## TF apply

```hcl
╰─❯ leverage tf apply -target=aws_identitystore_user.default -target=aws_identitystore_group_membership.default

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group_membership.default["juan.vera_devops"] will be created
  + resource "aws_identitystore_group_membership" "default" {
      + group_id          = "64b8e4d8-2021-7077-f761-7e9cb2c9b7ea"
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + member_id         = (known after apply)
      + membership_id     = (known after apply)
    }

  # aws_identitystore_user.default["juan.vera"] will be created
  + resource "aws_identitystore_user" "default" {
      + display_name      = "Juan Manuel Vera"
      + external_ids      = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-906752b26f"
      + user_id           = (known after apply)
      + user_name         = "juan.vera@binbash.com.ar"

      + emails {
          + primary = true
          + value   = "juan.vera@binbash.com.ar"
        }

      + name {
          + family_name = "Vera"
          + given_name  = "Juan Manuel"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│ 
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as part of an
│ error message.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_identitystore_user.default["juan.vera"]: Creating...
aws_identitystore_user.default["juan.vera"]: Creation complete after 1s [id=d-906752b26f/84289458-e001-7044-ecf4-aac99ca469b2]
aws_identitystore_group_membership.default["juan.vera_devops"]: Creating...
aws_identitystore_group_membership.default["juan.vera_devops"]: Creation complete after 0s [id=d-906752b26f/8408b448-9031-7037-4c78-d5aa79bb69e1]
╷
│ Warning: Applied changes may be incomplete
│ 
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully updated. Run the following command to
│ verify that no other changes are pending:
│     terraform plan
│ 
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use
│ it as part of an error message.
╵
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.


```